Repository: Isiguenza/mattermost-mobile-iOS
Catalog: ios/Mattermost/i18n/*.lproj/InfoPlist.strings
Languages: pl, tr

# NSAppleMusicUsageDescription
source: Enabling access to your media library means you can attach files from your media library to your messages in Mattermost iOS Lab.
pl: Włączenie dostępu do biblioteki multimediów oznacza, że możesz dołączać pliki z biblioteki multimediów do swoich wiadomości w Mattermost iOS Lab.
tr: Ortam kitaplığınıza erişimi etkinleştirerek, ortam kitaplığınızdaki dosyaları Mattermost iOS Lab adresindeki iletilerinize ekleyebilirsiniz.

# NSBluetoothAlwaysUsageDescription
source: Enabling access to Bluetooth means we can synchronize content across your devices and clients.
pl: Umożliwienie dostępu do Bluetooth oznacza, że możemy synchronizować treści pomiędzy urządzeniami i klientami.
tr: Bluetooth erişimini etkinleştirerek, içeriği aygıtlarınız ve istemcileriniz arasında eşitleyebilirsiniz.

# NSBluetoothPeripheralUsageDescription
source: Enabling access to Bluetooth means we can connect to audio peripherals for calls, and synchronize content across your devices and clients.
pl: Umożliwienie dostępu do Bluetooth oznacza, że możemy połączyć się z urządzeniami peryferyjnymi audio w celu prowadzenia rozmów, a także synchronizować zawartość pomiędzy urządzeniami i klientami.
tr: Bluetooth erişimini etkinleştirerek, aramalar için ses çevre birimlerine bağlanabilir ve içerikleri aygıtlarınız ile istemcileriniz arasında eşitleyebilirsiniz.

# NSCameraUsageDescription
source: Allowing access to your camera enables you to take photos or videos and attach them to messages.
pl: Zezwolenie na dostęp do aparatu umożliwia robienie zdjęć lub filmów i dołączanie ich do wiadomości.
tr: Kamera erişimini etkinleştirerek, fotoğraf ya da video çekebilir ve bunları iletilere ekleyebilirsiniz.

# NSFaceIDUsageDescription
source: Enabling access to your Face ID means we can restrict unauthorized users from accessing Mattermost iOS Lab on your device.
pl: Włączenie dostępu do Face ID oznacza, że możemy ograniczyć dostęp nieupoważnionych użytkowników do strony Mattermost iOS Lab na urządzeniu.
tr: Face ID erişimini etkinleştirerek, yetkisiz kullanıcıların aygıtınızdaki Mattermost iOS Lab uygulamasına erişmesini engelleyebilirsiniz.

# NSLocationAlwaysUsageDescription
source: Enabling access to your location data means we can add location metadata to pictures and videos you share in Mattermost iOS Lab.
pl: Umożliwienie dostępu do danych o lokalizacji oznacza, że możemy dodawać metadane dotyczące lokalizacji do zdjęć i filmów udostępnianych w Mattermost iOS Lab.
tr: Konum verileri erişimini etkinleştirerek, Mattermost iOS Lab üzerinden paylaştığınız görsel ve videolara konum üst verileri ekleyebilirsiniz.

# NSLocationWhenInUseUsageDescription
source: Enabling access to your location data means we can add location metadata to pictures and videos you share in Mattermost iOS Lab.
pl: Umożliwienie dostępu do danych o lokalizacji oznacza, że możemy dodawać metadane dotyczące lokalizacji do zdjęć i filmów udostępnianych w Mattermost iOS Lab.
tr: Konum verileri erişimini etkinleştirerek, Mattermost iOS Lab üzerinden paylaştığınız görsel ve videolara konum üst verileri ekleyebilirsiniz.

# NSMicrophoneUsageDescription
source: Enabling access to your device's microphones means you can capture audio for calls or videos to share in Mattermost iOS Lab.
pl: Umożliwienie dostępu do mikrofonów urządzenia oznacza możliwość rejestrowania dźwięku podczas rozmów lub nagrywania filmów w celu udostępnienia ich w witrynie Mattermost iOS Lab.
tr: Aygıtınızda mikrofon erişimini etkinleştirerek, Mattermost iOS Lab üzerinden çağrı ya da videolarda paylaşmak için sesi alabilirsiniz.

# NSPhotoLibraryAddUsageDescription
source: Enabling write access to your photo library means you can save downloaded photos and videos from Mattermost iOS Lab to your device.
pl: Włączenie dostępu do zapisu w bibliotece zdjęć oznacza możliwość zapisywania pobranych zdjęć i filmów z Mattermost iOS Lab w urządzeniu.
tr: Fotoğraf kitaplığınıza yazma erişimini etkinleştirerek, indirilen fotoğrafları ve videoları Mattermost iOS Lab ile aygıtınıza kaydedebilirsiniz.

# NSPhotoLibraryUsageDescription
source: Allowing access to your photo library enables you to select photos or videos and attach them to messages.
pl: Zezwolenie na dostęp do biblioteki zdjęć umożliwia wybieranie zdjęć lub filmów i dołączanie ich do wiadomości.
tr: Fotoğraf kitaplığınıza erişimi etkinleştirerek, fotoğraf ve videoları seçip iletilere ekleyebilirsiniz.

# NSSpeechRecognitionUsageDescription
source: Enabling your device to send user data to Apple means you can send voice messages to Mattermost iOS Lab.
pl: Zezwolenie urządzeniu na wysyłanie danych użytkownika do Apple oznacza możliwość wysyłania wiadomości głosowych na adres Mattermost iOS Lab.
tr: Aygıtınızın kullanıcı verilerini Apple üzerine göndermesine izin vererek, Mattermost iOS Lab ile sesli mesaj gönderebilirsiniz.
